Repository: 84000/data-translation-memory
Catalog: toh44-31_84000-the-ten-bhumis.tmx
Source language: bo
Languages: en

source: །དེ་ནི་དེ་བཞིན་གཤེགས་པ་གཅིག་ལས་གཟུངས་ཀྱི་སྒོ་བརྒྱ་སྟོང་གྲངས་མེད་པ་ཕྲག་བཅུས་ཆོས་ཁོང་དུ་ཆུད་པར་བྱེད་དེ།
en: Because of these millions of dhāraṇī doors he masters the Dharma he receives from one buddha.

source: དེ་བཞིན་གཤེགས་པ་གཅིག་ལས་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མཐའ་ཡས་པ་ལས་གཟུངས་ཀྱི་སྒོ་བརྒྱ་སྟོང་གྲངས་མེད་པ་ཕྲག་བཅུས་ཆོས་ཁོང་དུ་ཆུད་པར་བྱེད་དོ།
en: Just as he does with one buddha, he masters the Dharma from infinite buddhas because of those millions of dhāraṇī doors.

source: །དེ་སྨོན་པ་ཙམ་གྱིས་ཀྱང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ལས་ཆོས་ཀྱི་སྒོ་སྣང་བ་ཆེས་མང་དུ་ཡང་དག་པར་འཛིན་གྱི་ཉན་ཐོས་ཤིན་ཏུ་མང་དུ་ཐོས་པ་དང་ལྡན་པ་ཐོས་པ་འཛིན་པའི་གཟུངས་རབ་ཏུ་ཐོབ་པ་རྣམས་ཀྱིས་ནི་བསྐལ་པ་བརྒྱ་ཕྲག་སྟོང་དུ་ཡང་གཟུང་བའི་བྱིན་གྱི་རླབས་ཀྱིས་དེ་ལྟར་མྱི་ཟིན་ཏོ།
en: Simply through wishing for it, he receives the radiance of even more Dharma doors from the samyak­sambuddhas. This cannot be accomplished by a śrāvaka, even though he has attained a great stage of hearing many teachings, has attained the retention of remembering what he has heard, and has been empowered to possess it for hundreds of thousands of eons.

source: །དེ་ལྟར་དེ་ལྟ་བུའི་གཟུངས་ཐོབ་ཅིང་སྤོབས་པ་ཐོབ་པས་ཆོས་ཀྱི་གཏམ་བྱ་བའི་ཕྱིར་འདུག་ན། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་རྒྱས་པར་བཀང་སྟེ། ཆོས་ཀྱི་སྟན་ལ་འདུག་ཅིང་སེམས་ཅན་རྣམས་ལ་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྣམ་པར་ཕྱེ་ཞིང་ཆོས་སྟོན་ཏོ།
en: “He has that kind of attainment of retention and attainment of eloquence, so that when he sits down to teach the Dharma, he does so in all the worlds in a billion-world universe and teaches the Dharma on his Dharma throne to beings in accordance with their dispositions.

source: །དེའི་ཆོས་ཀྱི་སྟན་ཡང་དེ་བཞིན་གཤེགས་པ་དག་དང་། བྱང་ཆུབ་སེམས་དཔའ་དབང་བསྐུར་བའི་ས་ཐོབ་པ་མ་གཏོགས་པར་ཐམས་ཅད་ལས་འཕགས་ཤིང་སྣང་བ་ཚད་མྱེད་པ་དང་ལྡན་པ་ཡིན།
en: His Dharma throne is superior to those of everyone but the tathāgatas and bodhisattvas who have attained the bhūmi of empowerment, and it has an immeasurable radiance.

source: དེ་འདོད་ན་ཆོས་ཀྱི་སྟན་ལ་འདུག་ཅིང་དབྱངས་གཅིག་གིས་འཁོར་ཐམས་ཅད་དུ་སྒྲ་སྐད་སྣ་ཚོགས་རྣམ་པ་ཐ་དད་པས་ཡང་དག་པར་གོ་བར་བྱེད་དོ།
en: When he is seated on his Dharma throne, if he wishes to he speaks one sound that is understood by the entire assembly in their various different languages.

source: །འདོད་ན་སྒྲ་སྐད་སྣ་ཚོགས་དང་། དབྱངས་ཀྱི་ཡན་ལག་ཐ་དད་པ་རྣམ་པར་ཕྱེ་བས་འཁོར་ཐམས་ཅད་མངོན་པར་གོ་བར་བྱེད་དོ།
en: If he wishes to, he speaks one sound that will be an instruction given to the entire assembly in various languages and the different aspects of the voice.

source: །འདོད་ན་འོད་གཟེར་གྱི་སྒོ་ཉེ་བར་བསྒྲུབ་པས་ཆོས་ཀྱི་སྒོ་ཤིན་ཏུ་བརྗོད་དོ།
en: If he wishes to, he emits light-ray entrances that create Dharma entrances.

source: །འདོད་ན་བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་དབྱངས་རྣམ་པར་ཕྱེ་བ་ཤིན་ཏུ་བརྗོད་དོ།
en: If he wishes to, he emits voices from each pore.

source: །འདོད་ན་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་གཟུགས་སུ་སྣང་བ་ཇི་སྙེད་ཡོད་པའི་གཟུགས་སུ་སྣང་བ་དེ་དག་ལས་ཆོས་ཀྱི་སྒྲ་འབྱུང་བར་བྱེད་དོ།
en: If he wishes to, he appears as an illusory form in all the worlds of the billion-world universe and emits the sound of the Dharma from those forms.

source: །འདོད་ན་དབྱངས་ཀྱི་ཡན་ལག་གཅིག་གི་སྒྲས་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་ཁོང་དུ་ཆུད་པར་བྱེད་དོ།
en: If he wishes to, with one sound of his voice he gives an instruction to the entire realm of phenomena.

source: །འདོད་ན་སྒྲ་དང་དབྱངས་ཐམས་ཅད་ཆོས་ཀྱི་སྒྲར་བྱིན་གྱིས་རློབ་བོ།
en: If he wishes to, he blesses all sounds to become the sound of the Dharma.

source: །འདོད་ན་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ན་ཡོད་པའི་གླུ་དང་རོལ་མོ་བརྡུང་བ་དང་དཀྲོལ་བའི་སྒྲ་ཐམས་ཅད་ལས་ཆོས་ཀྱི་སྒྲ་འབྱུང་བར་བྱེད་དོ།
en: If he wishes to, he makes the sound of the Dharma come from all the singing, music, and musical instruments in all worlds.

source: །འདོད་ན་ཡི་གེ་གཅིག་གི་སྒྲ་ལས་ཆོས་ཐམས་ཅད་ཀྱི་ཚིག་རབ་ཏུ་ཕྱེ་བའི་སྒྲ་འབྱུང་བར་བྱེད་དོ།
en: If he wishes to, he causes the different sounds of all Dharma words to come from the sound of one syllable.

source: །འདོད་ན་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་ཤིང་བརྗོད་དུ་མྱེད་པའི་ས་དང་ཆུ་དང་མྱེ་དང་རླུང་གི་ཕུང་པོ་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་རྣམ་པར་ཕྱེ་བ་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་རེ་རེ་ལས་ཆོས་ཀྱི་སྒོ་བརྗོད་དུ་མྱེད་པ་འབྱུང་བར་བྱེད་དོ།
en: If he wishes to, he causes countless Dharma doors to come from each of the countless atoms of the immeasurable aggregation of earth, water, fire, and air in infinite worlds.

source: །གལ་ཏེ་དེ་ལ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་གཏོགས་པའི་སེམས་ཅན་རྣམས་འོངས་ཏེ། སྐད་ཅིག་ཡུད་ཙམ་ཐང་ཅིག་ཏུ་དྲི་བ་ཡོངས་སུ་འདྲི་ཞིང་དེ་དག་རེ་རེས་ཀྱང་སྒྲ་རྣམ་པ་ཐ་དད་པ་ཚད་མེད་པས་ཡོངས་སུ་དྲིས་པར་གྱུར་ལ། གཅིག་གིས་གང་དྲིས་བ་དེ་གཞན་མྱི་འདྲི་བར་གྱུར་ནའང་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་དེས་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱི་སྒྲ་ཚིག་སོ་སོ་དང་། ཡི་གེའི་འབྲུ་ཡན་ཅད་མ་ལུས་པར་བཟུང་སྟེ།
en: “If all the beings in the worlds of the billion-world universe were to come and in the same instant, the same moment, were to ask a question, with no one person asking the same question as another, in creating the sound of countless separate questions, the bodhisattva would understand every single syllable of each of those individual questions.

source: བཟུང་ནས་ཀྱང་ཚིག་གཅིག་མངོན་པར་བརྗོད་པས་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱི་སེམས་དང་བསམ་པ་ཚིམ་པར་བྱེད་པ་ནས།
en: Having understood them, with one sound of his voice he would bring satisfaction to the minds of all those beings.

source: འཇིག་རྟེན་གྱི་ཁམས་བརྗོད་དུ་མེད་པའི་བར་དུ་གཏོགས་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་དུ་དྲི་བ་ཡོངས་སུ་དྲིས་ཏེ། དེ་དག་རེ་རེ་ཞིང་ཡང་སྒྲ་རྣམ་པ་ཐ་དད་པ་ཚད་མེད་པས་དྲི་བར་གྱུར་ལ། གཅིག་གིས་ཅི་དྲིས་པ་དེ་གཞན་མྱི་འདྲི་བར་གྱུར་ནའང་དེ་དག་ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔའ་དེས་སྐད་ཅིག་ཡུད་ཙམ་ཐང་ཅིག་ཏུ་མ་ལུས་པར་བཟུང་སྟེ། སྒྲ་གཅིག་བརྗོད་པས་དེ་དག་ཐམས་ཅད་ཁོང་དུ་ཆུད་པར་བྱེད་དོ།
en: If all the beings in countless billion-world universes were to come and in the same instant, the same moment, were to ask a question, all asking questions in different languages, with no one person asking the same question as another, the bodhisattva would understand every single syllable of each of those individual questions, and having understood them, with one sound of his voice he would bring satisfaction to the minds of all those beings . . .

source: །དེ་འཇིག་རྟེན་གྱི་ཁམས་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མྱེད་པའི་བར་དག་ཀྱང་རྒྱས་པར་བཀང་ཞིང་སེམས་ཅན་རྣམས་ལ་བསམ་པ་དང་། དབང་པོ་དང་མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཆོས་སྟོན་ཏོ།
en: and so on, up to being present throughout countless universes and teaching the Dharma to beings according to their motivations, capabilities, and aspirations.

source: །ཆོས་ཀྱི་གཏམ་ལ་ཞུགས་པའི་ཚེ་ཡང་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ལེན་ཅིང་། སངས་རྒྱས་ཀྱི་མཛད་པ་ཐམས་ཅད་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་ལ་ཉེ་བར་གནས་པ་ཡིན་ཡང་།
en: “When he is seated and engaged in teaching the Dharma, he receives the blessing of the tathāgatas, and he accomplishes all the deeds of a buddha in the presence of all beings.

source: དེ་ལྟ་བུའི་ཡེ་ཤེས་སྣང་བས་འཛིན་པ་ཡོངས་སུ་རྩོམ་སྟེ།
en: “Even more than before he is engaged in obtaining the light of wisdom in this way:

source: གལ་ཏེ་སྐྲའི་རྩེ་མོའི་གོ་གཅིག་ལ་འཇིག་རྟེན་གྱི་ཁམས་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་ཇི་སྙེད་པ་དེ་སྙེད་ཀྱི་དེ་བཞིན་གཤེགས་པ་བཞུགས་ལ་དེ་སྙེད་དུ་ཚད་མྱེད་པར་གྱུར་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་དུ་ཆོས་བསྟན་ཏེ། དེ་བཞིན་གཤེགས་པ་དེ་དག་རེ་རེས་ཀྱང་དེ་སྙེད་ཀྱི་སེམས་ཅན་ཚད་མེད་པ་ལ་ཆོས་རྣམ་པ་ཐ་དད་པར་ཤིན་ཏུ་བསྟན་ཏེ། སེམས་ཅན་གྱི་བསམ་པའི་རྒྱུད་རེ་རེ་ལའང་དེ་སྙེད་དུ་ཆོས་ཉེ་བར་བསྒྲུབ་པ་ཚད་མྱེད་པ་ཉེ་བར་བསྒྲུབ་པར་གྱུར་ལ། དེ་བཞིན་གཤེགས་པ་གཅིག་གི་ཇི་ལྟ་བ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་དུ་སྟེ། སྐྲའི་རྩེ་མོའི་གོ་གཅིག་ལ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་དུ་དེ་ལྟར་གྱུར་ཀྱང་དེ་དག་ཐམས་ཅད་ཟིན་པར་འགྱུར་ན།
en: ‘If on the tip of a hair there are as many tathāgatas as there are atoms in countless worlds, teaching the Dharma to similarly countless assemblies, and each of those tathāgatas is teaching countless beings different Dharma teachings, and each of those beings is accomplishing the accomplishment of countless Dharma teachings, and just as one tathāgata does so all the tathāgatas do for all of their assemblies, and if just as it is on one hair tip so it is throughout the realm of phenomena, then I will have a vast memory and receive all the various illuminations of the Dharma from all those tathāgatas in one single instant and from one single sound.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ཙམ་དག་གི་སེམས་ཅན་རྣམས་ཀྱི་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: I shall, with the eloquence of certainty in the light of wisdom, bring satisfaction in a single instant to the minds of all who have been taught in those circles of assemblies, which are composed of all the different kinds of classes of Dharma pupils, and needless to say I will do so for the beings in these realms.’

source: དེ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ས་ལེགས་པའི་བློ་གྲོས་འདི་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཉིན་མཚན་དུ་ཡིད་ལ་བསམ་པ་གཞན་མེད་པར་སངས་རྒྱས་ཀྱི་སྤྱོད་ཡུལ་ལ་ཞུགས་པས་དེ་བཞིན་གཤེགས་པ་དང་འགྲོགས་པ་རབ་ཏུ་ཐོབ་ཅིང་།
en: “In that way the bodhisattva who has attained the bodhisattva bhūmi Perfect Understanding, with no other thought day or night and more than ever before engages in the conduct of the buddhas;

source: བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ཟབ་མོ་རབ་ཏུ་ཐོབ་པ་ཡིན།
en: he enters into the company of the tathāgatas and attains the profound liberation of the bodhisattvas.

source: དེ་དེ་ལྟ་བུའི་ཡེ་ཤེས་དང་ལྡན་ཞིང་མཉམ་པར་བཞག་ཀྱང་དེ་བཞིན་གཤེགས་པ་ལྟ་བ་ཡོངས་སུ་མྱི་སྤོང་སྟེ།
en: “Possessing that kind of wisdom, and resting in meditation, he does not desist from looking at the tathāgatas.

source: བསྐལ་པ་རེ་རེ་ཞིང་ཡང་སངས་རྒྱས་དུ་མ་ནས། སངས་རྒྱས་བརྒྱ་སྟོང་བྱེ་བ་ཁྲག་ཁྲིག་ལྟ་ཞིང་མཐོང་ནས་ཀྱང་རིམ་གྲོ་དང་། བཀུར་སྟི་དང་། བསྟི་སྟང་དང་། མཆོད་པ་བྱེད་དེ།
en: He sees the many buddhas in each eon up to a quintillion buddhas, and having seen he serves, worships, honors, and makes offerings.

source: སངས་རྒྱས་མཐོང་ཞིང་མཆོད་པ་བྱ་བ་རྒྱ་ཆེན་པོ་ཡོངས་སུ་མི་གཏོང་ངོ་། །དེ་བཞིན་གཤེགས་པ་དེ་དག་ལ་ཞུ་བ་ཡོངས་སུ་ཞུ་བ་བྱེད་དེ།
en: “He never ceases from looking at the buddhas and making vast offerings to them.

source: ཆོས་ཀྱི་གཟུངས་རབ་ཏུ་བསྟན་པ་ལས་ཤིན་ཏུ་འབྱུང་བ་ཡིན།
en: He asks questions to those buddhas, and from that teaching comes the retention of the Dharma.

source: དེའི་དགེ་བའི་རྩ་བ་དེ་དག་སྔོན་བས་ཀྱང་ཤིན་ཏུ་བྱང་ཞིང་མྱི་འཕྲོགས་པར་འགྱུར་ཏེ།
en: His roots of goodness become more purified and unassailable than ever before.

source: གསེར་གྱི་ས་ལེ་སྦྲམ་དེ་ཉིད་མགར་བ་མཁས་པས་རྒྱན་ཏུ་བྱས་ཏེ། ཡོངས་སུ་ཟིན་པ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོའི་ཡན་ལག་གི་དམ་པ་མགོ་འམ་མགུལ་དུ་བཏགས་ན།
en: To give an analogy, it is like gold that has been fashioned by a skilled goldsmith into an adornment and is worn on the head or throat of a cakravartin king.

source: ཁམས་ཀྱི་རྒྱལ་པོ་ཐམས་ཅད་དང་། གླིང་བཞི་བའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་རྒྱན་གྱི་རྣམ་པས་མྱི་ཐུབ་ཅིང་མྱི་འཕྲོགས་པ་ཡིན།
en: It cannot be rivaled or overcome by the adornments of all local kings or all beings in the four continents.

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ས་ལེགས་པའི་བློ་གྲོས་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའི་དགེ་བའི་རྩ་བ་དེ་དག་ཀྱང་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་། ས་འོག་མ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་མྱི་འཕྲོགས་ཤིང་མི་ཐུབ་པ་ཡིན།
en: “O jinaputras! In that same way, the roots of goodness of the śrāvakas, pratyekabuddhas, and bodhisattvas on the lower bhūmis cannot surpass the roots of goodness of the bodhisattva on this bodhisattva bhūmi called Perfect Understanding.

source: དེའི་དགེ་བའི་རྩ་བ་སྣང་བ་དེས་ནི་སེམས་ཅན་རྣམས་ཀྱི་ཉོན་མོངས་པ་དང་། སེམས་ཀྱི་ཐིབས་པོ་སྣང་བར་བྱས་ཏེ།
en: The radiance of his roots of goodness illuminates the darkness of the afflicted minds of beings and dispels it.

source: དེ་ཉིད་ནས་ཕྱིར་ལྡོག་གོ །ཀྱེ་རྒྱལ་བའི་སྲས་དག་འདི་ལྟ་སྟེ་དཔེར་ན།
en: “O jinaputras!

source: སྟོང་གཉིས་ལ་དབང་བའི་ཚངས་པ་ཆེན་པོ་ནི་སྟོང་གཉིས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་ཐིབས་པོ་དམའ་བར་གཞོལ་བ་ཡོངས་སུ་སྣང་བར་བྱེད་དོ།
en: To give an analogy, it is like a great Brahmā who rules over two billion-world universes and illuminates the darkness of all the worlds below him in the two universes.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའི་ས་ལེགས་པའི་བློ་གྲོས་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའི་དགེ་བའི་རྩ་བའི་སྣང་བ་དེ་ཡང་སེམས་ཅན་རྣམས་ཀྱི་ཉོན་མོངས་པ་དང་། སེམས་ཀྱི་ཐིབས་པོ་སྣང་བར་བྱས་ཏེ།
en: “O jinaputras! In that same way, the radiance of the roots of goodness of the bodhisattva on this bodhisattva bhūmi called Perfect Understanding illuminates the darkness of the afflicted minds of beings and dispels it.

source: དེ་ཉིད་ནས་ཕྱིར་ལྡོག་གོ །དེའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བཅུ་ལས་སྟོབས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཤས་ཆེ་བ་ཡིན་ཏེ། ལྷག་མ་རྣམས་ཀྱང་ཅི་ཚུལ་ཅི་ནུས་སུ་ཡང་དག་པར་མི་བསྒྲུབ་པ་མ་ཡིན་ནོ།
en: “From among the ten perfections, the perfection of strength predominates, and the other perfections are not accomplished fully and completely.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ས་ལེགས་པའི་བློ་གྲོས་ཤེས་བྱ་བ་སྟེ།
en: “O jinaputras!

source: བྱང་ཆུབ་སེམས་དཔའི་ས་དགུ་པ་མདོར་བསྟན་པའོ།
en: That in brief is the bodhisattva bhūmi Perfect Understanding, the ninth bodhisattva bhūmi.

source: །དེ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཕལ་ཆེར་ཚངས་པ་ཆེན་པོར་གྱུར་ཏེ།
en: Most of the bodhisattvas on that bhūmi become a great Brahmā who has gained great might and power.

source: སྟོབས་དང་མཐུ་ཆེན་པོ་ཐོབ་པ་སྟོང་གཉིས་ལ་དབང་ཞིང་ཟིལ་གྱིས་ནོན་པ། གཞན་གྱི་ཟིལ་གྱིས་མྱི་ནོན་པ།
en: He has power over and overpowers two billion-world universes, and no one else can overpower him.

source: མཐུན་པའི་དོན་མཐོང་བ་དབང་ཤིན་ཏུ་ཐོབ་པ།
en: When he sees an appropriate object, he has power over it.

source: སེམས་ཅན་རྣམས་ལ་ཉན་ཐོས་དང་རང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་སྟོན་པ་ལ་མཁས་ཤིང་མཐུ་ཡོད་པ་སྟེ། སེམས་ཅན་གྱི་བསམ་པ་ཡོངས་སུ་དྲིས་པ་བསྟན་པས་མྱི་འཕྲོགས་པ་ཡིན། དེ་སྦྱིན་པ་འམ། ངག་སྙན་པ་འམ། དོན་བསྒྲུབ་པ་འམ།
en: He is wise and powerful in teaching the perfections to beings, śrāvakas, pratyekabuddhas, and bodhisattvas, and he cannot be overcome by the thoughts and questions of beings.

source: དོན་མཐུན་པས་དགེ་བའི་རྩ་བ་གང་ཅི་རྩོམ་ཡང་རུང་སྟེ། དེ་ཐམས་ཅད་ཇི་ལྟར་ན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མཆོག་ཏུ་འགྱུར། གཙོ་བོར་འགྱུར། ཐུ་བོར་འགྱུར། ཕུལ་དུ་འགྱུར། དམ་པར་འགྱུར། བླ་ན་མྱེད་པར་འགྱུར།
en: “In whatever roots of goodness he accomplishes through generosity, kind words, actions that benefit others, and practicing what he preaches, he becomes supreme, the best, the foremost, the highest, the most excellent, the unsurpassable, the guide, the leader, the commander, and so on, up until becoming the omniscient one who is relied on.

source: འདྲེན་པར་འགྱུར། ཡོངས་སུ་འདྲེན་པར་འགྱུར་བ་ནས། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་རྟེན་པའི་བར་དུ་འགྱུར་སྙམ་སྟེ། སངས་རྒྱས་ཡིད་ལ་བྱ་བ་དང་། ཆོས་ཡིད་ལ་བྱ་བ་དང་། དགེ་འདུན་ཡིད་ལ་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཡིད་ལ་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡིད་ལ་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་ཡིད་ལ་བྱ་བ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡིད་ལ་བྱ་བ་དང་། སྟོབས་ཡིད་ལ་བྱ་བ་དང་། མྱི་འཇིགས་པ་ཡིད་ལ་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ཡིད་ལ་བྱ་བ་ནས། རྣམ་པའི་མཆོག་ཐམས་ཅད་དང་ལྡན་པའི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་བར་དུ་ཡིད་ལ་བྱ་བ་དང་། མྱི་འབྲལ་བ་ཡིན་ཏེ།
en: His mind is always focused on the Buddha, focused on the Dharma, focused on the Saṅgha, focused on the bodhisattvas, focused on bodhisattva conduct, focused on the bodhisattva bhūmis, focused on the perfections, focused on the strengths, focused on the confidences, focused on the unique qualities of buddhahood, and so on, up until being focused on the omniscient wisdom endowed with the supreme aspects.

source: དེ་འདོད་ན་སྐད་ཅིག་ཡུད་ཙམ་ཐང་ཅིག་ཏུ་ཏིང་ངེ་འཛིན་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མྱེད་པ་བརྒྱ་སྟོང་ཕྲག་བཅུ་ཚང་བའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་རབ་ཏུ་ཐོབ་ཅིང་དེ་དག་ལ་སྙོམས་པར་འཇུག་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པ་བརྒྱ་སྟོང་ཕྲག་བཅུ་ཚང་བའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་མཐོང་བ་དང་། དེ་དག་གི་བྱིན་གྱི་རླབས་ཀྱང་ཡང་དག་པར་ཤེས་པ་དང་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མྱེད་པ་བརྒྱ་སྟོང་ཕྲག་བཅུ་ཚང་བའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་སྐྱོད་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པ་བརྒྱ་སྟོང་ཕྲག་བཅུ་ཚང་བའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དུ་འགྲོ་བ་དང་། འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པ་བརྒྱ་སྟོང་ཕྲག་བཅུ་ཚང་བའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་སྣང་བར་བྱ་བ་དང་། སེམས་ཅན་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པ་བརྒྱ་སྟོང་ཕྲག་བཅུ་ཚང་བའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བ་དང་། བསྐལ་པ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པ་བརྒྱ་སྟོང་ཕྲག་བཅུ་ཚང་བའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དུ་གནས་པར་བྱ་བ་དང་། སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའི་བསྐལ་པ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པ་བརྒྱ་སྟོང་ཕྲག་བཅུ་ཚང་བའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ལ་རབ་ཏུ་འཇུག་པ་དང་། ཆོས་ཀྱི་སྒོ་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པ་བརྒྱ་སྟོང་ཕྲག་བཅུ་ཚང་བའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་རྣམ་པར་འབྱེད་པ་དང་། ལུས་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པ་བརྒྱ་སྟོང་ཕྲག་བཅུ་ཚང་བའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཡོངས་སུ་བསྟན་པ་དང་། ལུས་རེ་རེ་ལ་ཡང་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་སངས་རྒྱས་ཀྱི་ཞིང་གྲངས་མེད་པ་བརྒྱ་སྟོང་ཕྲག་བཅུ་ཚང་བའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཡང་དག་པར་བསྟན་པའི་བརྩོན་འགྲུས་ཀྱི་རྣམ་པ་དེ་ལྟ་བུ་རྩོམ་མོ། །དེ་ཡན་ཅད་བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་གྱི་མཐུ་ཅན་རྣམས་སྨོན་ལམ་གྱི་ཁྱད་པར་གྱིས་རྣམ་པར་འཕྲུལ་ཏེ།
en: “If he wishes to, he applies himself in such a way that in just one instant he attains as many samādhis as there are atoms in countless millions of buddha realms, sees as many buddhas as there are atoms in countless millions of buddha realms and knows their blessings, causes as many billion-world universes to shake as there are atoms in countless millions of buddha realms, goes to as many buddha realms as there are atoms in countless millions of buddha realms, illuminates as many universes as there are atoms in countless millions of buddha realms, ripens as many beings as there are atoms in countless millions of buddha realms, remains for as many eons as there are atoms in countless millions of buddha realms, comprehends as many previous and future eons as there are atoms in countless millions of buddha realms, opens as many Dharma doors as there are atoms in countless millions of buddha realms, manifests as many bodies as there are atoms in countless millions of buddha realms, and manifests each body having a retinue of as many bodhisattvas as there are atoms in countless millions of buddha realms. That is the kind of diligence he undertakes.

source: དེ་དག་གི་ལུས་སམ་འོད་དམ་རྫུ་འཕྲུལ་ལམ། མྱིག་གམ་སྤྱོད་ཡུལ་ལམ། དབྱངས་སམ་སྤྱོད་པ་འམ། རྒྱན་ཏམ་བྱིན་གྱི་རླབས་སམ། མོས་པ་འམ་མངོན་པར་འདུ་བྱེད་པ་དག་ཀྱང་བསྐལ་པ་དུ་མ་དང་། བསྐལ་པ་བརྒྱ་ཕྲག་དུ་མ་དང་། བསྐལ་པ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མས་ཀྱང་བགྲང་བར་དཀའོ།
en: “From this time onward the bodhisattvas who have the power of prayer through particular prayers manifest bodies, light, miracles, sights, activities, voices, conduct, displays, blessings, transformations, and manifestations for many eons, for many hundreds of eons, many thousands of eons, many hundreds of thousands of eons, and so on, until many quintillions of eons, which are difficult to enumerate.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེའི་སྙིང་པོས་སའི་དོན་འདི་ཉིད་ཡང་བརྟག་པར་བྱ་བ་དང་བསྟན་པར་བྱ་བའི་ཕྱིར། དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ།
en: Then the bodhisattva Vajra­garbha, in order to analyze and teach the meaning of this bhūmi, recited these verses:

source: །དེ་དག་ཚད་མེད་སྟོབས་ཀྱི་བློ་ཡིས་རྣམ་དཔྱོད་ཅིང་།
en: “They who have analyzed with intelligence that has immeasurable power,

source: །ཡེ་ཤེས་ཕྲ་བའི་དམ་པ་འགྲོ་བས་ཤེས་དཀའ་བ།
en: Who have subtle, supreme wisdom that is inconceivable to beings,

source: །དེ་བཞིན་གཤེགས་པ་གསང་བའི་གནས་ལ་ཡང་དག་འཇུག །འགྲོ་བའི་དོན་བྱེད་དེ་དག་ས་དགུ་ཡོངས་སུ་གནོན།
en: Who have entered the secret state of the tathāgatas, And who benefit beings, ascend to the ninth bhūmi.

source: །དེ་དག་གཟུངས་མཆོག་ཏིང་འཛིན་ཆེ་བ་ཉིད་མཆོག་དང་། །མངོན་ཤེས་ཡངས་དང་དེ་བཞིན་ཞིང་འཇུག་མཐའ་ཡས་དང་། །སྟོབས་དང་རྟོགས་པའི་ཡེ་ཤེས་རྒྱལ་བའི་བརྟན་གནས་དང་། །སྨོན་ལམ་སྙིང་རྗེའི་བསམ་པས་མཁས་པ་དགུ་ལ་འཇུག །ས་དགུ་ལྡན་པ་དེ་དག་རྒྱལ་བའི་མཛོད་འཛིན་ཅིང་།
en: “They who have the doors of retention, the highest samādhis, Vast clairvoyance, entry into infinite realms, The certainty of powerful wisdom, and the constant state of the jinas— These wise ones with compassionate prayers reach the ninth. “They who have gained this bhūmi possess the treasure of the jinas.

source: །དགེ་བའི་ཆོས་དང་མྱི་དགེ་ལུང་དུ་མ་བསྟན་དང་། །ཟག་དང་བཅས་དང་འཇིག་རྟེན་པ་དང་འཕགས་པ་དང་། །བསམ་དུ་རུང་དང་བསམ་དུ་མི་རུང་མཁས་པས་ཤེས།
en: Those wise ones understand good, bad, and neutral qualities, The sullied, the mundane, and the superior,

source: །ངེས་པའི་ཆོས་དང་མ་ངེས་ཆོས་ཀྱང་རབ་ཏུ་རྟོགས།
en: The conceivable and the inconceivable. “They know well what are definite and indefinite qualities.

source: །ཐེག་གསུམ་ཕུན་སུམ་ཚོགས་པའི་བྱ་བ་ཡོངས་སུ་འཇལ།
en: They have full knowledge of the activities included in the three yānas.

source: །འདུས་བྱས་རྣམ་པར་ཕྱེ་དང་གྲངས་དང་རྒྱུ་བ་དག །འཇིག་རྟེན་ཇི་ལྟར་མངོན་བྱེད་དེ་ལ་རབ་ཏུ་འཇུག །དེ་དག་དེ་འདྲའི་ཤེས་ལྡན་བློ་མཆོག་ཕྲ་ལྡན་པ།
en: They accomplish the practice and understanding of the qualities of the bhūmis, And in that way they enter into the world. “They have that kind of wisdom—supreme, subtle intelligence—

source: །སེམས་ཅན་སེམས་ཀྱི་ཐིབས་པོ་ཡོངས་སུ་རྟོག་པ་བྱེད།
en: And they examine the mental complexity of beings. They continuously comprehend the infinite formations of the mind, The mind that in each instant has various progressions and reversals. “They comprehend being accompanied by beginningless kleśas, The overwhelming propensities that lead to the classes of existence, The various classifications of the processes of karma, Causes, cessation, and unavoidable results. “They comprehend inferior, middling, and superior faculties

source: །རྣམ་ཤེས་སྣ་ཚོགས་མྱུར་དུ་འགྱུར་ཞིང་ལྡོག་པ་དང་། །རྣམ་ཤེས་མཐའ་ཡས་འབྱུང་ལ་རྟག་ཏུ་མཁས་པ་འཇུག །ཉོན་མོངས་མཐའ་ཡས་སྦྱོར་དང་གྲོགས་སུ་འགྱུར་བ་དང་། །ཀུན་ནས་འཁོར་དང་བག་ཉལ་འགྲོ་རྒྱུད་མཚམས་སྦྱོར་དང་། །ལས་རྣམས་སྣ་ཚོགས་རྣམ་པར་ཕྱེ་ལ་འང་དེ་བཞིན་འཇུག །རྒྱུ་དང་འགོག་དང་འབྲས་བུ་འཇིག་ལའང་ཡང་དག་འཇུག །དབང་པོ་རྣོ་དང་ཐ་མ་འབྲིང་དང་ཡངས་པ་དང་། །ཐ་དད་སྔོན་དང་ཕྱི་མའི་མཐའ་ལའང་ཡང་དག་འཇུག །མོས་པ་དགེ་དང་མི་དགེ་སྣ་ཚོགས་དུ་མ་དག །སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞི་ཀུན་ལ་ཡང་དག་འཇུག །ཁམས་ཀྱི་རྣམ་པ་ཉོན་མོངས་ལྟ་བ་སྲིད་པ་རྣམས།
en: And the separation into past and future. They comprehend the numerous varieties of the eighty-four thousand good and bad motivations. “The process of sensory elements, becoming a being, afflicted views, The continuous beginningless and endless state of complexity,

source: །ཐིབས་པོ་གྱུར་པ་སྔ་ཕྱི་མེད་ཅིང་འཆད་མེད་དང་། །བག་ཉལ་བསམ་པ་ལྷན་ཅིག་སྐྱེས་པའི་རྒྱུད་རྣམས་ཀྱི།
en: The innate activity of dispositions and propensities,

source: །སེམས་རྣམས་ཀུན་རྒྱུ་འབྲེལ་ཅིང་རྒྱུན་ཆད་མྱི་འགྱུར་བ།
en: And the unbroken continuity of mind-created bondage.

source: །བསམ་པ་བག་ཉལ་རྒྱུད་ཡོད་དངོས་པོ་མ་ཡིན་ཏེ།
en: “The propensities of the mind are not material.

source: །ཡུལ་ལ་མི་གནས་བསམ་པ་ཡོངས་སུ་འབྲལ་མི་འགྱུར།
en: The intentions do not remain in a location, nor do they depart.

source: །ཤེས་པར་དཀའ་བའི་བསམ་གཏན་ཡུལ་ལས་ཕྱིར་མྱི་ལྡོག །རྡོ་རྗེ་ལྟ་བུའི་ལམ་གྱིས་ཆོད་འགྱུར་གཞན་གྱིས་མྱིན།
en: They are difficult to eliminate, and they cannot be defeated by the scope of dhyāna. They are cut through by the vajra of the path alone, and by nothing else. “They comprehend the different processes for birth in the six classes of existence:

source: །རྒྱུད་དྲུག་སྐྱེ་བ་རྣམ་པར་ཕྱེ་ལ་རབ་ཏུ་འཇུག །སྲེད་རླན་མ་རིག་མུན་པ་དེ་བཞིན་ལས་ཀྱི་ཞིང་།
en: The moisture of craving, the darkness of ignorance, and the fields of karma,

source: །རྣམ་ཤེས་ས་བོན་བཅས་འབྱུང་མྱུ་གུ་མྱིང་དང་གཟུགས།
en: The seeds of consciousness, the connate sprouts of name-and-form,

source: །ཁམས་གསུམ་སྔོན་མཐའ་མེད་པར་དེ་དག་རབ་ཏུ་འཇུག །དེ་དག་བག་ཆགས་ཚུལ་དང་ཉོན་མོངས་ལས་དང་སེམས།
en: And the beginningless and endless three realms. “Freed from the tendencies, the kleśas,

source: །འདོད་ཆགས་བྲལ་བས་ལམ་གྱི་རྒྱུད་དུ་འབྱུང་བ་མྱིན།
en: Karma, and the mind, desire no longer arises.

source: །སེམས་ཅན་ཕུང་པོ་གསུམ་དུ་ངེས་པ་ཡང་དག་ཤེས།
en: They comprehend the three definitive groups of beings.

source: །ལྟ་བར་བྱིང་བ་ཤེས་པའི་ལམ་དང་དེ་དག་ལྡན།
en: They comprehend the knowledge of immersion in views.

source: །དེ་འདྲའི་ཤེས་ལྡན་ས་མཆོག་འདི་ལ་གནས་པ་སྟེ།
en: “Those who have developed in this way, who are on this bhūmi,

source: །སེམས་ཅན་བསམ་པ་མོས་པ་དབང་པོའི་ཚུལ་བཞིན་དུ།
en: In accordance with the dispositions, faculties, and motivations of all beings
